XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ4Aplus-M4G1_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="16"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="6"/>
          <feature type="I2C"           n="3"                           name="I2C"/>
          <feature type="I2C"           n="3"                           name="EI2C"/>
          <feature type="ADC"           n="16"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="12"/>
          <feature type="IOs"           n="91"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="I2S"           n="2" />
          <feature type="QFP"           n="100" name="LQFP 100 14x14x0.5"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM4Gx Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>   
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM4GRx CMSIS">
      <description>Toshiba TMPM4GRx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4GR*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4GQx CMSIS">
      <description>Toshiba TMPM4GQx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4GQ*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4GNx CMSIS">
      <description>Toshiba TMPM4GNx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4GN*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>

    <!-- Startup TMPM4GRx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4GRx CMSIS">
      <description>System Startup for Toshiba TMPM4GRx Devices</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_TMPM4GRx      /* Device Startup for TMPM4GRx */
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4GR.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4GR.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="1.0.0" condition="TMPM4Gx Compiler"/>
      </files>
    </component>
    <!-- Startup TMPM4GQx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4GQx CMSIS">
      <description>System Startup for Toshiba TMPM4GQx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4GQ.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4GQ.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="1.0.0" condition="TMPM4Gx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4GNx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4GNx CMSIS">
      <description>System Startup for Toshiba TMPM4GNx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Gx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4GN.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4GN.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Gx.c"      attr="config" version="1.0.0" condition="TMPM4Gx Compiler"/>
      </files>
    </component>

  </components>

</package>
